docs/spec/html/shelves.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000008">1. Shelves（棚）仕様（MVP）</a>
<ul>
<li><a href="#org0000000">1.1. 目的</a></li>
<li><a href="#org0000001">1.2. ガードレール</a></li>
<li><a href="#org0000003">1.3. MVPのShelf定義（案）</a>
<ul>
<li><a href="#org0000002">1.3.1. Shelf Type: host（ドメイン棚）</a></li>
</ul>
</li>
<li><a href="#org0000004">1.4. 必要データ（SQLite）</a></li>
<li><a href="#org0000005">1.5. Shelf一覧（観測窓）の最小出力（案）</a></li>
<li><a href="#org0000006">1.6. 実装メモ（クエリ例）</a></li>
<li><a href="#org0000007">1.7. 将来拡張（Topic棚）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0000008" class="outline-2">
<h2 id="org0000008"><span class="section-number-2">1.</span> Shelves（棚）仕様（MVP）</h2>
<div class="outline-text-2" id="text-1">
<p>
このドキュメントは、S2（不可視）層の「存在の匂わせ」を実現するための Shelf を、
実装に繋がる形で定義する。
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>S2のContent本文を一覧表示せずに、「最近こういう系がいくつかある」を観測できるようにする。</li>
<li>棚は「価値」ではなく「扱い方/観測単位」であり、ランキングやスコアリングはしない。</li>
</ul>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> ガードレール</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Shelf一覧で本文（article_text）や原文の全件一覧を出さない。</li>
<li>Shelfの順序は「重要度」ではなく、決定的な並び（例: 最終更新時刻降順→同率はキー昇順）にする。</li>
<li>Shelf名に評価語（重要/必読/おすすめ等）を入れない。</li>
</ul>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.3.</span> MVPのShelf定義（案）</h3>
<div class="outline-text-3" id="text-1-3">
<p>
MVPでは、棚の動的クラスタリング（Topicベース）は後回しにし、まずは決定的で実装容易な「ホスト（ドメイン）棚」を採用する。
これは `concepts.org` の「関連Topicを束ねる」という理想より粗いが、匂わせ層の最小実装として妥当。
</p>
</div>

<div id="outline-container-org0000002" class="outline-4">
<h4 id="org0000002"><span class="section-number-4">1.3.1.</span> Shelf Type: host（ドメイン棚）</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Shelfキー: `url_host`（例: `sqlite.org`, `x.com`）</li>
<li>含まれるContent: `contents.url_host <code>= &lt;key&gt;` かつ `contents.state =</code> 'S2'`</li>
<li>表示名: 通常は `key`（必要なら将来、手動エイリアスを追加）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">1.4.</span> 必要データ（SQLite）</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>`contents.url_host`（URLから抽出したホスト名、小文字）
<ul class="org-ul">
<li>`ingest_url` 実行時に保存する（推奨）</li>
<li>保存しない場合は、表示時にURLから毎回抽出してもよい（ただし実装は複雑化する）</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">1.5.</span> Shelf一覧（観測窓）の最小出力（案）</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Shelf一覧は「棚ごとの集約情報」のみを出す。
</p>

<ul class="org-ul">
<li>必須:
<ul class="org-ul">
<li>`shelf_key`（host）</li>
<li>`count`（S2の件数）</li>
<li>`last_updated_at`（その棚に属するS2 Contentの最新 `updated_at`）</li>
</ul></li>
<li>任意:
<ul class="org-ul">
<li>Topic意図ラベルの分布（将来）</li>
<li>再遭遇（Recall）指標（将来）</li>
</ul></li>
</ul>

<p>
例（テキスト）:
</p>

<p>
```text
SHELVES (S2 only)
sqlite.org | count=12 | updated=2026-01-31T12:34:56Z
x.com      | count= 3 | updated=2026-01-30T08:01:02Z
```
</p>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">1.6.</span> 実装メモ（クエリ例）</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-sql">SELECT
  url_host AS shelf_key,
  COUNT(*) AS count,
  MAX(updated_at) AS last_updated_at
FROM contents
WHERE state = 'S2'
GROUP BY url_host
ORDER BY last_updated_at DESC, shelf_key ASC;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000007" class="outline-3">
<h3 id="org0000007"><span class="section-number-3">1.7.</span> 将来拡張（Topic棚）</h3>
<div class="outline-text-3" id="text-1-7">
<p>
将来的に `Topic` ベースで棚を形成する場合は、以下を検討する。
</p>

<ul class="org-ul">
<li>形成方式（例）:
<ul class="org-ul">
<li>embedding + clustering</li>
<li>LLMによるラベリング + ルールベース集約</li>
<li>TF-IDF + cosine similarity（決定性を担保しやすい）</li>
</ul></li>
<li>注意:
<ul class="org-ul">
<li>グルーピング結果が揺れても「状態遷移」を引き起こさない（S3以上に上げない）</li>
<li>形成の結果は“観測”用途に留め、価値判断に見せない</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
